{
    "settings_title": "Paramètres",
    "managing_account_title": "Gérer le compte",
    "managing_account_description": "Modifiez les paramètres et préférences de votre compte.",
    "change_password": "Changer le mot de passe",
    "change_password_description": "Changez votre mot de passe pour sécuriser votre compte.",
    "change_language": "Changer de langue",
    "language_preference": "Choisissez la langue dans laquelle vous êtes le plus à l'aise.",
    "terms_title": "Termes et Conditions",
    "terms_intro_title": "Introduction",
    "terms_intro_text": "Bienvenue sur FinanceTracker ! Veuillez lire attentivement ces termes et conditions, car ils constituent un accord juridiquement contraignant entre vous, l'utilisateur final, et les développeurs de FinanceTracker, une application de finances personnelles conçue uniquement pour un usage personnel et non pour des conseils commerciaux ou professionnels. En accédant ou en utilisant FinanceTracker de quelque manière que ce soit, y compris, mais sans s'y limiter, la navigation, la saisie de données, la génération de rapports et l'accès aux fonctionnalités du compte, vous acceptez explicitement de respecter ces termes, qui visent à réglementer votre utilisation de l'application, vos responsabilités en tant qu'utilisateur, les limitations de responsabilité de FinanceTracker et d'autres obligations légales importantes pouvant affecter vos droits. Les termes suivants sont complets, détaillés et verbeux, destinés à protéger pleinement les développeurs tout en fournissant des indications claires à l'utilisateur concernant les actions autorisées et interdites, la confidentialité des données, les limitations de responsabilité et autres clauses légales nécessaires dans toutes les juridictions.",
    "user_obligations_title": "Obligations de l'utilisateur",
    "user_obligations_text": "En tant qu'utilisateur de FinanceTracker, vous acceptez de fournir des informations exactes, complètes et à jour concernant votre compte, vos données financières, vos informations personnelles et toutes autres entrées pertinentes nécessaires au bon fonctionnement de l'application. Vous reconnaissez également que tout usage abusif, modification, accès non autorisé, tentative de rétro-ingénierie, distribution ou toute tentative de contourner le fonctionnement prévu de FinanceTracker constitue une violation de ces termes et conditions et peut entraîner la résiliation de votre compte, des signalements aux autorités ou d'autres actions légales. Les utilisateurs sont responsables de la confidentialité de leurs identifiants de compte, y compris les mots de passe et les tokens d'authentification, et sont seuls responsables de toutes les activités effectuées sous leurs comptes. Les développeurs de FinanceTracker ne peuvent être tenus responsables de tout dommage, perte ou action non autorisée résultant du non-respect de ces obligations ou de toute négligence dans la protection des identifiants de compte.",
    "privacy_title": "Confidentialité",
    "privacy_text": "FinanceTracker respecte votre vie privée et prend toutes les mesures raisonnables pour assurer la protection et la confidentialité de vos données personnelles et financières. Toutes les informations collectées, y compris, mais sans s'y limiter, les noms, les relevés financiers, l'historique des transactions et les identifiants personnels, seront stockées en toute sécurité en utilisant des protocoles de chiffrement et de sécurité standards de l'industrie. Ces informations ne seront jamais vendues, louées ou partagées avec des tiers à des fins commerciales. Les utilisateurs reconnaissent que, bien que tous les efforts soient faits pour protéger les données, aucun système numérique n'est totalement à l'abri des violations, et FinanceTracker ne peut donc garantir une sécurité absolue. Les utilisateurs consentent au stockage, au traitement et à l'accès de leurs données uniquement pour fournir les fonctionnalités de l'application, l'analyse, le dépannage et autres services essentiels au fonctionnement de FinanceTracker.",
    "disclaimer_title": "Avertissement",
    "disclaimer_text": "FinanceTracker est un outil de finances personnelles fourni 'tel quel' et destiné uniquement à des fins d'information, d'éducation et de suivi. Les développeurs ne font aucune déclaration ni garantie d'aucune sorte, expresse ou implicite, concernant l'exactitude, l'exhaustivité ou la fiabilité des informations affichées ou générées par l'application. En aucun cas, FinanceTracker ou ses développeurs ne pourront être tenus responsables de tout dommage direct, indirect, accessoire, consécutif ou punitif résultant de l'utilisation de l'application, y compris, mais sans s'y limiter, les pertes financières, les erreurs de calcul, la mauvaise gestion des comptes ou tout autre résultat découlant de la confiance accordée aux informations fournies par l'application. Les utilisateurs sont fortement encouragés à vérifier leurs propres dossiers, à consulter des conseillers financiers professionnels et à faire preuve de jugement indépendant avant de prendre des décisions financières. L'utilisation de cette application constitue une reconnaissance et une acceptation de ces avertissements.",
    "changes_title": "Modifications des termes",
    "changes_text": "FinanceTracker se réserve le droit de mettre à jour, modifier ou remplacer ces termes et conditions à tout moment sans préavis à l'utilisateur. Les termes mis à jour deviennent effectifs immédiatement après leur publication dans l'application, et l'utilisation continue de l'application après ces mises à jour constitue une acceptation des termes révisés. Les utilisateurs sont responsables de consulter régulièrement les termes et conditions afin d'assurer le respect continu. Le non-respect des termes mis à jour n'exonère pas les utilisateurs de leurs obligations et ne diminue en rien l'applicabilité des termes et conditions révisés. En continuant à utiliser FinanceTracker après les mises à jour, vous reconnaissez avoir lu, compris et accepté toutes les modifications, amendements ou révisions dans leur intégralité.",
    "change_username": "Changer le nom",
    "change_username_description": "Vous pouvez changer votre surnom quand vous le voulez.",
    "dashboard_title": "Tableau de bord",
    "total_income": "Revenus Totaux",
    "total_expenses": "Dépenses Totales",
    "remaining_balance": "Solde Restant",
    "uncategorized": "Non catégorisé",
    "unset": "Non défini",
    "no description": "Aucune description",
    "dashboard": "Tableau de bord",
    "incomes": "Revenus",
    "expenses": "Dépenses",
    "categories": "Categories",
    "settings": "Paramètres",
    "support": "Support",
    "logout": "Se Déconnecter",
    "app_title": "Personal Finance Tracker",
    "login_welcome": "Bon retour ! Veuillez vous connecter pour continuer.",
    "email_address": "Adresse e-mail",
    "email_placeholder": "vous@exemple.com",
    "password_label": "Mot de passe",
    "password_placeholder": "••••••••",
    "remember_me": "Se souvenir de moi",
    "forgot_password": "Mot de passe oublié ?",
    "sign_in": "Se connecter",
    "new_to_app": "Nouveau sur Personal Finance Tracker ?",
    "create_account": "Créer un compte",
    "or_with": "ou avec",
    "google": "Google",
    "apple": "Apple",
    "signup_title": "Créez votre compte",
    "or_text": "Ou",
    "sign_in_existing": "connectez-vous à votre compte existant",
    "username_label": "Nom d'utilisateur",
    "username_placeholder": "John Doe",
    "confirm_password": "Confirmer le mot de passe",
    "sign_up_button": "S'inscrire",
    "categories_title": "Catégories",
    "table_name": "Nom",
    "table_created": "Créé",
    "table_actions": "Actions",
    "rename": "Renommer",
    "delete": "Supprimer",
    "search_categories": "Rechercher des catégories",
    "search_placeholder": "Rechercher par nom...",
    "clear": "Effacer",
    "category_name_label": "Nom de la catégorie",
    "enter_category_placeholder": "Entrez un nom",
    "delete_confirm_text": "Êtes-vous sûr de vouloir supprimer cette catégorie ? Cette action est irréversible.",
    "force_delete_label": "Forcer la suppression même si elle est utilisée",
    "cancel": "Annuler",
    "expenses_categories": "Catégories de dépenses",
    "recent_expenses": "Dépenses récentes",
    "add": "Ajouter",
    "add_new": "Ajouter",
    "income": "Revenu",
    "name": "Nom",
    "amount": "Montant",
    "source": "Source",
    "update": "Mettre à jour",
    "description": "Description",
    "select_category": "Sélectionner une catégorie",
    "one_time": "Unique",
    "recurring": "Récurrent",
    "filter_by_category": "Filtrer par catégorie",
    "close": "Fermer",
    "search": "Rechercher",
    "expense": "Dépense",
    "change_theme": "Changer le thème",
    "start_date": "Date de début",
    "end_date": "Date de fin",
    "category": "Catégorie",
    "expense_type": "Type de dépense",
    "month": "Mois",
    "all": "Tout",
    "display_settings_title": "Affichage",
    "display_settings_description": "Changez les paramètres d'affichage de l'application.",
    "currency_settings_title": "Devise",
    "delete_data_title": "Gérer les données",
    "delete_data_description": "Effacer vos données est irréversible.",
    "confirm_delete": "Supprimer tout vos données",
    "delete_confirm_message": "Êtes-vous sûr de vouloir supprimer toutes vos données ?",
    "delete_success": "Toutes vos données ont été supprimées.",
    "delete_error": "Une erreur est survenue. Veuillez réessayer.",
    "ok": "OK",
    "account_delete_success": "Compte supprimé. Vous serez déconnecter.",
    "account_delete_confirm_message": "Êtes-vous sûr de vouloir supprimer votre compte ? Les données seront irrecuperables",
    "account_confirm_delete": "Supprimer votre compte",
    "expense_confirm_delete": "Êtes-vous sûr de supprimer cette dépense ?",
    "general_account_informations": "Informations génerales du compte",
    "join_date": "Date de création",
    "local_date_format": "fr-FR"
}